"""
Задача 1. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.
"""
a = 5  #101
b = 6  #110

print('Введенные числа 10сс (2сс):')
print(f'a = {a} ({format(a,"b")})')
print(f'b = {b} ({format(b,"b")})')

print('Результаты побитовых операций 10сс (2сс): ')
print(f'a AND b = {a & b} ({format(a & b,"b")})')
print(f'a OR b\t=  {a | b} ({format(a | b,"b")})')
print(f'a XOR b\t=  {a ^ b} ({format(a ^ b,"b")})')
print(f'a >> 2 =  {a >> 2} ({format(a >> 2,"b")})')
print(f'a << 2\t=  {a << 2} ({format(a << 2,"b")})')

